import random

def run():
    col = int(input('Количество чисел(от 1 до 1000):'))
    while col<1 or col>1000:
        print('Выберите другое число')
        col = int(input('Количество чисел(от 1 до 1000):'))
    a = int(input('Минимальное число(от -10**10 до 10**10):'))
    while a<-10**10 or a >10**10:
        print('Выберите другое число')
        a = int(input('Минимальное число(от -10**10 до 10**10):'))
    b = int(input('Максимальное число(от -10**10 до 10**10):'))
    while b<-10**10 or b >10**10:
        print('Выберите другое число')
        b = int(input('Максимальное число(от -10**10 до 10**10):'))
    for i in range(col):
        print(random.randint(a,b))
